Repository: OpenDataServices/flatten-tool
Catalog: flattentool/locale/*/LC_MESSAGES/flatten-tool.po
Languages: es

source: Non-numeric value "{}" found in number column, returning as string instead.
es: Un valor no numérico "{}" se encuentra en la columna numérica y se devuelve como una cadena.

source: Non-integer value "{}" found in integer column, returning as string instead.
es: Un valor no-integral "{}" se encuentra en la columna integral y se devuelve como una cadena.

source: Unrecognised value for boolean: "{}", returning as string instead
es: Un valor no reconocido para boolean: "{}", se devuelve como una cadena.

source: Non-numeric value "{}" found in number array column, returning as string array instead).
es: Un valor no numérico "{}" se encuentra en la columna numérica y se devuelve como una cadena).

source: because it treats {} as an array, but another column does not
es: porque trata {} como una matriz, pero otra columna no lo hace

source: Overwriting cell {} by mistake
es: Sobrescritura de celda {} por error

source: because it treats {} as an object, but another column does not
es: porque trata {} como un objeto, cuando otra columna no lo hace

source: because another column treats it as an array or object
es: porque otra columna lo trata como una matriz u objeto

source: You may have a duplicate Identifier: We couldn't merge these rows with the {}: field "{}" in sheet "{}": one cell has the value: "{}", the other cell has the value: "{}"
es: Puede tener un Identificador duplicado: No pudimos combinar estas filas con el {}: campo "{}" en la hoja "{}" con una celda que tiene "{}", la otra célula tiene: "{}"

source: Duplicate heading "{}" found, ignoring the data in columns {} and {} (sheet: "{}").
es: Se encontró un encabezado duplicado "{}", ignorando los datos en la columna {} y {} (hoja:: "{}").

source: Duplicate heading "{}" found, ignoring the data in column {} (sheet: "{}").
es: Se encontró un encabezado duplicado "{}", ignorando los datos en la columna {} (hoja:: "{}").

source: Row/cell collision: {}
es: Colisión de fila/célula: {}

source: Already have key {}
es: Ya tiene clave {}

source: Two sub-cells have different values: {}, {}
es: Dos sub-células tienen valores diferentes: {}, {}

source: Unexpected result type in the JSON cell tree: {}
es: Un tipo de resultado inesperado en el árbol de celdas JSON: {}

source: The supplied file has extension .xlsx but isn't an XLSX file.
es: El archivo suministrado tiene la extensión .xlsx pero no es un archivo XLSX.

source: Column "{}" has been ignored because it is a number.
es: La columna "{}" se ha ignorado porque es un número.

source: There is an array at '{}' when the schema says there should be a '{}'
es: Hay una matriz en '{}' cuando el esquema dice que debería haber un '{}'

source: Column {} has been ignored, because it treats {} as an array, but another column does not.
es: La columna {} ha sido ignorada porque trata a {} como una matriz, pero otra columna no.

source: Column {} has been ignored, because it treats {} as an object, but another column does not.
es: La columna {} ha sido ignorada porque trata a {} como un objeto, pero otra columna no.

source: There is an object or list at '{}' but it should be an {}
es: Hay un objeto o una lista en '{}' pero debería ser un {}

source: Column {} has been ignored, because another column treats it as an array or object
es: La columna {} se ha ignorado porque otra columna la trata como una matriz u objeto

source: Using rollUp values from schema, ignoring direct input.
es: Usar valores acumulados del esquema, ignorando la entrada directa.

source: No fields to rollup found (pass json path directly, as a list in a file, or via a schema)
es: No se encontraron campos para resumir (pase la ruta json directamente, como una lista en un archivo o mediante un esquema)

source: Invalid value passed for rollup (pass json path directly, as a list in a file, or via a schema)
es: Se pasó un valor no válido para el resumen (pase la ruta json directamente, como una lista en un archivo o mediante un esquema)

source: Etiher json_filename or root_json_dict must be supplied
es: Se debe proporcionar el r json_filename o root_json_dict

source: Only one of json_file or root_json_dict should be supplied
es: Solo uno de json_filename o root_json_dict debe de proporcionarse

source: You wanted to preserve the following fields which are not present in the supplied schema: {}
es: Quería conservar los siguientes campos que no están presentes en el esquema proporcionado: {}

source: You wanted to preserve the following fields which are not present in the input data: {}
es: Quería conservar los siguientes campos que no están presentes en los datos de entrada: {}

source: Warning: No schema was provided so column headings are JSON keys, not titles.
es: Advertencia: No se proporcionó ningún esquema, por lo que los encabezados de las columnas son claves JSON, no títulos.

source: Rolled up values must be basic types
es: Los valores acumulados deben ser tipos básicos

source: More than one value supplied for "{}". Could not provide rollup, so adding a warning to the relevant cell(s) in the spreadsheet.
es: Más de un valor proporcionado para "{}". No se pudo proporcionar el resumen, por lo que se agregó una advertencia a las celda(s) relevantes en la hoja de cálculo.

source: WARNING: More than one value supplied, consult the relevant sub-sheet for the data.
es: ADVERTENCIA: Más de un valor suministrado, consulte la sub-hoja correspondiente para los datos.

source: Unsupported type {}
es: Tipo no admitido {}

source: Character(s) in '{}' are not allowed in a spreadsheet cell. Those character(s) will be removed
es: Los caracteres de '{}' no están permitidos en una celda de hoja de cálculo. Se eliminarán esos carácter(es)

source: One of schema_filename or root_schema_dict must be supplied
es: Se debe proporcionar un schema_filename o root_schema_dict

source: Only one of schema_filename or root_schema_dict should be supplied
es: Solo se debe proporcionar un schema_filename o root_schema_dict

source: Field {} does not have a title, skipping.
es: El campo {} no tiene título, se omite.

source: Field {}{}/0/{} is missing a title, skipping.
es: Al campo {}{}/0/{} le falta un título y se salta.

source: Field {}{} does not have a title, skipping it and all its children.
es: El campo {}{} no tiene título, lo omite y todos sus elementos secundarios.

source: Unknown type_set: {}, did you forget to explicity set the "type" key on "items"?
es: Type_set desconocido: {}, ¿olvidó establecer explícitamente la clave "type" en "items"?

source: Unrecognised types {} for property "{}" with context "{}",so this property has been ignored.
es: Tipos no reconocidos {} para la propiedad "{}" con contexto "{}", por lo que esta propiedad se ha ignorado.

source: Skipping field "{}", because it has no properties.
es: Omitiendo el campo "{}", porque no tiene propiedades.
